In [1]:
import pandas as pd

# series

In [ ]:
pd.Series()

In [5]:
lst=[1,2,3,7,9,0]

In [7]:
ser=pd.Series(lst)

In [8]:
ser

0    1
1    2
2    3
3    7
4    9
5    0
dtype: int64

In [9]:
ser.size

6

In [10]:
ser.shape

(6,)

In [12]:
ser.dtype

dtype('int64')

In [13]:
ser.name="numbers"

In [14]:
ser

0    1
1    2
2    3
3    7
4    9
5    0
Name: numbers, dtype: int64

In [20]:
ser.iloc[-1]#index location=iloc---implicit index----inbuilt index

0

In [21]:
ser.index=list("abcdef")---#user define index=label

In [22]:
ser

a    1
b    2
c    3
d    7
e    9
f    0
Name: numbers, dtype: int64

In [25]:
ser.loc["f"]

0

In [26]:
ser["d"]

7

In [27]:
ser["a":"e"]#stop is also included

a    1
b    2
c    3
d    7
e    9
Name: numbers, dtype: int64

In [28]:
ser[0:4]

a    1
b    2
c    3
d    7
Name: numbers, dtype: int64

In [29]:
ser

a    1
b    2
c    3
d    7
e    9
f    0
Name: numbers, dtype: int64

# How to delete a particular value from a series

del ser[]---permanently remove

ser.drop([])---temprory not make change in existing series    ser.drop([],inplace=True)---make change in existing series

In [31]:
del ser["a"]

In [32]:
ser

b    2
c    3
d    7
e    9
f    0
Name: numbers, dtype: int64

In [36]:
ser.drop(["c"])

b    2
d    7
e    9
f    0
Name: numbers, dtype: int64

In [37]:
ser

b    2
c    3
d    7
e    9
f    0
Name: numbers, dtype: int64

In [38]:
ser.drop(["c"],inplace=True)

In [39]:
ser

b    2
d    7
e    9
f    0
Name: numbers, dtype: int64

In [40]:
ser.drop(["b","e"])

d    7
f    0
Name: numbers, dtype: int64

In [41]:
ser

b    2
d    7
e    9
f    0
Name: numbers, dtype: int64

# Creating a series using a dictionary

In [43]:
emp={'Name':'Suresh',
    'Code':101,
    'Age':25,
    'Address':'Noida'}
emp1=pd.Series(emp)
emp1

Name       Suresh
Code          101
Age            25
Address     Noida
dtype: object

In [44]:
emp1.name="Employee details"

In [45]:
emp1

Name       Suresh
Code          101
Age            25
Address     Noida
Name: Employee details, dtype: object

In [46]:
emp1[0]

'Suresh'

In [47]:
emp1["Code"]

101

In [48]:
emp1.dtype

dtype('O')

# Series is Mutable----ser[index]=value we want

In [50]:
ser

b    2
d    7
e    9
f    0
Name: numbers, dtype: int64

In [52]:
ser[1],ser[2]=ser[2],ser[1]

In [53]:
ser

b    2
d    9
e    7
f    0
Name: numbers, dtype: int64

# insert in series--convert it into a list than insert it----ser.to_list()
                              than insert it ----lst.insert(index,value u want to insert)

In [54]:
lst=ser.to_list()
lst

[2, 9, 7, 0]

In [55]:
lst.insert(0,5)

In [56]:
lst

[5, 2, 9, 7, 0]

In [57]:
pd.Series(lst)

0    5
1    2
2    9
3    7
4    0
dtype: int64

# Data Frame

In [58]:
pd.DataFrame()

Empty DataFrame
Columns: []
Index: []

# creating a dataframe

dictionary

In [59]:
emp={'Name':['Akshata','Sai Jyothi','Mahesh','Puneet','Sakina','Amrith','Arvind'],
    'Code':[101,102,103,104,105,106,107],
    'City':['Delhi','Pune','Mumbai','Dehradun','Chennai','Bangalore','Noida']}

In [60]:
pd.DataFrame(emp)

         Name  Code       City
0     Akshata   101      Delhi
1  Sai Jyothi   102       Pune
2      Mahesh   103     Mumbai
3      Puneet   104   Dehradun
4      Sakina   105    Chennai
5      Amrith   106  Bangalore
6      Arvind   107      Noida

### change the sequence of the columns---pd.DataFrame(emp,columns=["Code","Name","City"])

### add a new columns--pd.DataFrame(emp,columns=["Code",'Name','City','Department','Phone']) or 
                                    data['Type']='IT'---- directly adding column and providing data

### adding data into columns---data[ ]=

data=pd.DataFrame(emp,columns=['Code','Name','City','Department','Phone'])

data

data["Company"]=['Learnbay','Wipro','Infosys','TCS','Accenture','Microsoft','HCL']

# Create a data frame using list

In [2]:
import pandas as pd

In [3]:
names=['Akshata','Sai Jyothi','Mahesh','Puneet','Sakina','Amrith','Arvind']
pd.DataFrame(names)

            0
0     Akshata
1  Sai Jyothi
2      Mahesh
3      Puneet
4      Sakina
5      Amrith
6      Arvind

In [8]:
df=pd.DataFrame(names,columns=["Names"])

In [9]:
df

        Names
0     Akshata
1  Sai Jyothi
2      Mahesh
3      Puneet
4      Sakina
5      Amrith
6      Arvind

In [14]:
df.rename(columns={"Names":"num"})

          num
0     Akshata
1  Sai Jyothi
2      Mahesh
3      Puneet
4      Sakina
5      Amrith
6      Arvind

### Renaming columns
df = df.rename(columns={'Age': 'Years'})

# Creating a dataframe using 2 or more lists---

zip----pd.DataFrame(list(zip(name,code)),columns=['Name','ID'])

# Create a dataframe using a 2-D list

In [63]:
lst=[['Akshata',101,25],['Sai Jyothi',102,24],['Mahesh',103,26],['Puneet',104,25],['Sakina',105,24],['Amrith',106,26],['Arvind',107,24]]

In [66]:
pd.DataFrame(lst,columns=["name","code","age"])

         name  code  age
0     Akshata   101   25
1  Sai Jyothi   102   24
2      Mahesh   103   26
3      Puneet   104   25
4      Sakina   105   24
5      Amrith   106   26
6      Arvind   107   24

# Creating a dataframe using series objects

pd.DataFrame(list(zip()))

or

pd.DataFrame({'Name':ser_name,

             'Code':ser_code,
             
             'City':ser_city},columns=['City','Name','Code'])

# Concatenation of dataframes----join 2 dataframes pd.concat([dataframe_1,dataframe_2],axis=0,ignore_index=True(to get  continue indexes))

# Indexing and Slicing of a dataframe
User defined indexes, also alled as labels

data.index=list('abcdefg')

In [1]:
# To fetch the data on the basis of implicit indexes we use .iloc method
# To fetch the data on the basis of labels we use .loc method

In [ ]:
data.iloc[[4]]....#double squre brack...
e	Sakina	105	Chennai# it gives is dataframe format

In [ ]:
data.iloc[4]..#single sq brac...
Name     Sakina
Code        105
City    Chennai
Name: e, dtype: object       #it gives in series format

In [ ]:
data.iloc[0,0]...# specific element..[row,col]
'Akshata'

In [ ]:
#in slicing we can use single square brac...data[start:stop:step]

# How to import a csv file

In [ ]:
pd.read_csv(r"path")

# head()---returns first 5 rows
# tail()---returns last 5 rows

head(no of rows we want)

tails(no of rows we want)

# data.shape---gives (rows,cols)
# data.columns---gives names of all columns
# data.describe()---It returns some statistical measures of the dataset.like count,mean,std,min,max,25%,50%,70%
                    #It is applicable only on numeric columns
# data.info()--It gives some information about the dataset---it tells Non-Null Count in each col
# data.nunique()---It returns the number of unique values in each column means This function is handy when you want to quickly determine how many different items or categories exist within a specific dataset column.
                   #unique we check for columns only means duplicate values and for rows we say duplicate values
# How to access a particular column---data.column_name / data["col_name"]=gives in series format
                                     # data[["col_name"]] / data[["col_name","col_name",..]]=gives dataframe format
# slicing---[rows slicing,cols slicing]...data.iloc[0:10,0:8]  data.loc[0:78,"Survived":"Age"]
# data.col_name.unique()--It returns the unique values in a particular column
# value_counts()--It returns the count of the unique values in a column
                  # data.col_name.value_counts()---gives total no
                  # data.col_name.value_counts()*100/len(data)---gives percent
                  # data.col_name.value_counts(dropna=False)---dropna = false gives total no of null values
# Handling the nan values
1- We can drop the null values
2- We can fill the null values with some other values
### data.dropna()...inplace=True...change existing data      data.dropna().reset_index()...reset index again from 0
It drops all the rows that have atleast one null value
### data.dropna(how="any"/"all")....any--drop row if any nan value it is same like dropna & all---Drop the rows that have all the values as null values
### data.col_name.fillna(value)---data.Age.fillna(data.Age.mean(),inplace=True)
In a discrete column we fill the null values by mean or median value.---data.col_name.mean/median()
In a categorical column we fill the null values by mode value.---data.col_name.mode()[0/1...]
[0] after mode(), it indicates that you're accessing the first mode value from the resulting Series, which is typically the primary mode in the context of handling missing values.
# Dropping the columns--data.drop(column_name,axis=1,inplace=True)
# drop multiple columns--data.drop(['PassengerId','Cabin','Name'],axis=1,inplace=True)
# Dropping the rows---data.drop(row_index,axis=0)
# drop multiple rows---data.drop([0,2,5]).reset_index())

# filter the data----you can use various techniques and conditions to extract rows that meet specific criteria. Here's an example of how to filter data based on a condition:

# groupby()---It is used to compare two or more columns together and get some aggregation

# Transformation of the Data--we use logic ex np.where(cond,x,y)

# clip()--It is used to cap the values between lower and upper limit in a column means min and max value
np.where(cond,x,np.where(cond,x,y)) or

data.clip(lower=value,upper=value)---easy way

# data.col_nme.apply()--Inside apply() we use lambda().By using apply() we can transform the values in any column

# melt()---It is used to reshape the dataset.

In pandas, the melt function is used to reshape or transform a DataFrame from a wide format to a long format.
This operation is particularly useful when you have a DataFrame where columns represent variables or categories, 
and you want to gather these columns into rows, possibly with new columns to identify the original variable or category.
This can make the data more suitable for various types of analysis and visualization.

Here's the basic syntax of the melt function in pandas:

pandas.melt(frame, id_vars=None, value_vars=None, var_name=None, value_name='value', col_level=None)

frame: The DataFrame you want to melt.
id_vars: Columns to be kept as-is in the melted DataFrame, i.e., columns that you don't want to transform. These columns will become the "identifier variables."
value_vars: Columns to be melted (unpivoted) into rows. If not specified, all columns not in id_vars will be melted.
var_name: The name of the new column that will store the variable (column name) corresponding to the values.
value_name: The name of the new column that will store the values from the melted columns.
col_level: If the input DataFrame has multi-level columns, this parameter specifies the level from which to melt.

# merge()--merging refers to the process of combining two or more dataframes based on a common column or index. It is similar to SQL JOIN operations and is a fundamental operation when working with tabular data. Pandas provides several functions for merging dataframes, including merge(), concat(), and join(). Here, I will focus on the merge() function, which is commonly used for merging dataframes in pandas.

The basic syntax of the merge() function is as follows:

merged_df = pd.merge(left, right, how='inner', on=None, left_on=None, right_on=None, left_index=False, right_index=False, suffixes=('_x', '_y'))

Let's break down the key parameters of the merge() function:

left and right: The dataframes you want to merge.

how: Specifies the type of merge to be performed. Common options include:

'inner': This performs an inner join, which returns only the rows with matching values in both dataframes.
'outer': This performs an outer join, which returns all rows from both dataframes and fills in missing values with NaN.
'left': This performs a left join, which returns all rows from the left dataframe and the matching rows from the right dataframe.
'right': This performs a right join, which returns all rows from the right dataframe and the matching rows from the left dataframe.
on: The column(s) on which to join the dataframes. This should be specified if the dataframes have a common column name.

left_on and right_on: If the dataframes don't share a common column name, you can specify the columns from the left and right dataframes to use for the join.

left_index and right_index: Set to True if you want to use the dataframe indices for merging instead of columns.

suffixes: If there are overlapping column names in the left and right dataframes, you can specify suffixes to distinguish them in the merged dataframe.

# pivot_table()--data.pivot_table(index=,columns=,values=)

In pandas, the pivot_table() function is used to create a spreadsheet-style pivot table from a given dataframe. A pivot table allows you to summarize and analyze data by aggregating and reshaping it, typically using one or more columns as rows, columns, and values in the table.

Here's the basic syntax for pivot_table():

pd.pivot_table(data, values=None, index=None, columns=None, aggfunc='mean', fill_value=None, margins=False, margins_name='All', dropna=True, observed=False)
Let's break down the key parameters of the pivot_table() function:

data: The dataframe containing the data you want to pivot.

values: The column(s) whose values will be aggregated in the pivot table. You can specify one or more columns as a list.

index: The column(s) to be used as the index (rows) in the pivot table. This represents the unique identifiers for each row in the pivot table.

columns: The column(s) to be used as the columns in the pivot table. These represent the categories or groups by which the data will be segmented horizontally.

aggfunc: The aggregation function to be applied to the values in the pivot table. Common aggregation functions include 'mean', 'sum', 'count', 'min', 'max', etc.

fill_value: An optional parameter to specify a value to fill missing entries in the pivot table.

margins: If set to True, it adds row and column margins to the pivot table, which display totals for rows and columns. Default is False.

margins_name: The name for the row and column margins if margins is set to True.

dropna: If set to True, it excludes columns with all NaN values from the pivot table. Default is True.

observed: If set to True, it only shows observed values for categorical groupings. This is used when working with categorical data and specifying aggfunc='mean'.

Here's an example of how to use pivot_table():

# How to iterate over a dataset?

In [ ]:
#gives col names only
for i in data:
    print(i)

In [ ]:
# get row wwise
data.iterrows()
You can use the iterrows() method to iterate row by row. It returns an iterator that yields pairs of index 
and row data as Series.
However, this method can be slow for large DataFrames.

In [ ]:
# get col wise
data.iteritems()
iteritems() is used to iterate over the columns of the DataFrame df. 
For each iteration, you get the column name (column_name) 
and the corresponding column data (column_data) as a pandas Series.

In [ ]:
# data.itertuples()
It returns the named tuples

# How to export a dataset to a csv or excel file

In [ ]:
# data.to_csv('file_name.csv')
# data.to_excel('file_name.xlsx')